espressif/esp-idf/components/soc/esp32p4/include/soc/core0_interrupt_reg.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** CORE0_LP_RTC_INT_MAP_REG register
 *  NA
 */
#define CORE0_LP_RTC_INT_MAP_REG (DR_REG_CORE0_BASE + 0x0)
/** CORE0_CORE0_LP_RTC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LP_RTC_INT_MAP    0x0000003FU
#define CORE0_CORE0_LP_RTC_INT_MAP_M  (CORE0_CORE0_LP_RTC_INT_MAP_V << CORE0_CORE0_LP_RTC_INT_MAP_S)
#define CORE0_CORE0_LP_RTC_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LP_RTC_INT_MAP_S  0

/** CORE0_LP_WDT_INT_MAP_REG register
 *  NA
 */
#define CORE0_LP_WDT_INT_MAP_REG (DR_REG_CORE0_BASE + 0x4)
/** CORE0_CORE0_LP_WDT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LP_WDT_INT_MAP    0x0000003FU
#define CORE0_CORE0_LP_WDT_INT_MAP_M  (CORE0_CORE0_LP_WDT_INT_MAP_V << CORE0_CORE0_LP_WDT_INT_MAP_S)
#define CORE0_CORE0_LP_WDT_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LP_WDT_INT_MAP_S  0

/** CORE0_LP_TIMER_REG_0_INT_MAP_REG register
 *  NA
 */
#define CORE0_LP_TIMER_REG_0_INT_MAP_REG (DR_REG_CORE0_BASE + 0x8)
/** CORE0_CORE0_LP_TIMER_REG_0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LP_TIMER_REG_0_INT_MAP    0x0000003FU
#define CORE0_CORE0_LP_TIMER_REG_0_INT_MAP_M  (CORE0_CORE0_LP_TIMER_REG_0_INT_MAP_V << CORE0_CORE0_LP_TIMER_REG_0_INT_MAP_S)
#define CORE0_CORE0_LP_TIMER_REG_0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LP_TIMER_REG_0_INT_MAP_S  0

/** CORE0_LP_TIMER_REG_1_INT_MAP_REG register
 *  NA
 */
#define CORE0_LP_TIMER_REG_1_INT_MAP_REG (DR_REG_CORE0_BASE + 0xc)
/** CORE0_CORE0_LP_TIMER_REG_1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LP_TIMER_REG_1_INT_MAP    0x0000003FU
#define CORE0_CORE0_LP_TIMER_REG_1_INT_MAP_M  (CORE0_CORE0_LP_TIMER_REG_1_INT_MAP_V << CORE0_CORE0_LP_TIMER_REG_1_INT_MAP_S)
#define CORE0_CORE0_LP_TIMER_REG_1_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LP_TIMER_REG_1_INT_MAP_S  0

/** CORE0_MB_HP_INT_MAP_REG register
 *  NA
 */
#define CORE0_MB_HP_INT_MAP_REG (DR_REG_CORE0_BASE + 0x10)
/** CORE0_CORE0_MB_HP_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_MB_HP_INT_MAP    0x0000003FU
#define CORE0_CORE0_MB_HP_INT_MAP_M  (CORE0_CORE0_MB_HP_INT_MAP_V << CORE0_CORE0_MB_HP_INT_MAP_S)
#define CORE0_CORE0_MB_HP_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_MB_HP_INT_MAP_S  0

/** CORE0_MB_LP_INT_MAP_REG register
 *  NA
 */
#define CORE0_MB_LP_INT_MAP_REG (DR_REG_CORE0_BASE + 0x14)
/** CORE0_CORE0_MB_LP_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_MB_LP_INT_MAP    0x0000003FU
#define CORE0_CORE0_MB_LP_INT_MAP_M  (CORE0_CORE0_MB_LP_INT_MAP_V << CORE0_CORE0_MB_LP_INT_MAP_S)
#define CORE0_CORE0_MB_LP_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_MB_LP_INT_MAP_S  0

/** CORE0_PMU_REG_0_INT_MAP_REG register
 *  NA
 */
#define CORE0_PMU_REG_0_INT_MAP_REG (DR_REG_CORE0_BASE + 0x18)
/** CORE0_CORE0_PMU_REG_0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_PMU_REG_0_INT_MAP    0x0000003FU
#define CORE0_CORE0_PMU_REG_0_INT_MAP_M  (CORE0_CORE0_PMU_REG_0_INT_MAP_V << CORE0_CORE0_PMU_REG_0_INT_MAP_S)
#define CORE0_CORE0_PMU_REG_0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_PMU_REG_0_INT_MAP_S  0

/** CORE0_PMU_REG_1_INT_MAP_REG register
 *  NA
 */
#define CORE0_PMU_REG_1_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1c)
/** CORE0_CORE0_PMU_REG_1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_PMU_REG_1_INT_MAP    0x0000003FU
#define CORE0_CORE0_PMU_REG_1_INT_MAP_M  (CORE0_CORE0_PMU_REG_1_INT_MAP_V << CORE0_CORE0_PMU_REG_1_INT_MAP_S)
#define CORE0_CORE0_PMU_REG_1_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_PMU_REG_1_INT_MAP_S  0

/** CORE0_LP_ANAPERI_INT_MAP_REG register
 *  NA
 */
#define CORE0_LP_ANAPERI_INT_MAP_REG (DR_REG_CORE0_BASE + 0x20)
/** CORE0_CORE0_LP_ANAPERI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LP_ANAPERI_INT_MAP    0x0000003FU
#define CORE0_CORE0_LP_ANAPERI_INT_MAP_M  (CORE0_CORE0_LP_ANAPERI_INT_MAP_V << CORE0_CORE0_LP_ANAPERI_INT_MAP_S)
#define CORE0_CORE0_LP_ANAPERI_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LP_ANAPERI_INT_MAP_S  0

/** CORE0_LP_ADC_INT_MAP_REG register
 *  NA
 */
#define CORE0_LP_ADC_INT_MAP_REG (DR_REG_CORE0_BASE + 0x24)
/** CORE0_CORE0_LP_ADC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LP_ADC_INT_MAP    0x0000003FU
#define CORE0_CORE0_LP_ADC_INT_MAP_M  (CORE0_CORE0_LP_ADC_INT_MAP_V << CORE0_CORE0_LP_ADC_INT_MAP_S)
#define CORE0_CORE0_LP_ADC_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LP_ADC_INT_MAP_S  0

/** CORE0_LP_GPIO_INT_MAP_REG register
 *  NA
 */
#define CORE0_LP_GPIO_INT_MAP_REG (DR_REG_CORE0_BASE + 0x28)
/** CORE0_CORE0_LP_GPIO_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LP_GPIO_INT_MAP    0x0000003FU
#define CORE0_CORE0_LP_GPIO_INT_MAP_M  (CORE0_CORE0_LP_GPIO_INT_MAP_V << CORE0_CORE0_LP_GPIO_INT_MAP_S)
#define CORE0_CORE0_LP_GPIO_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LP_GPIO_INT_MAP_S  0

/** CORE0_LP_I2C_INT_MAP_REG register
 *  NA
 */
#define CORE0_LP_I2C_INT_MAP_REG (DR_REG_CORE0_BASE + 0x2c)
/** CORE0_CORE0_LP_I2C_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LP_I2C_INT_MAP    0x0000003FU
#define CORE0_CORE0_LP_I2C_INT_MAP_M  (CORE0_CORE0_LP_I2C_INT_MAP_V << CORE0_CORE0_LP_I2C_INT_MAP_S)
#define CORE0_CORE0_LP_I2C_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LP_I2C_INT_MAP_S  0

/** CORE0_LP_I2S_INT_MAP_REG register
 *  NA
 */
#define CORE0_LP_I2S_INT_MAP_REG (DR_REG_CORE0_BASE + 0x30)
/** CORE0_CORE0_LP_I2S_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LP_I2S_INT_MAP    0x0000003FU
#define CORE0_CORE0_LP_I2S_INT_MAP_M  (CORE0_CORE0_LP_I2S_INT_MAP_V << CORE0_CORE0_LP_I2S_INT_MAP_S)
#define CORE0_CORE0_LP_I2S_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LP_I2S_INT_MAP_S  0

/** CORE0_LP_SPI_INT_MAP_REG register
 *  NA
 */
#define CORE0_LP_SPI_INT_MAP_REG (DR_REG_CORE0_BASE + 0x34)
/** CORE0_CORE0_LP_SPI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LP_SPI_INT_MAP    0x0000003FU
#define CORE0_CORE0_LP_SPI_INT_MAP_M  (CORE0_CORE0_LP_SPI_INT_MAP_V << CORE0_CORE0_LP_SPI_INT_MAP_S)
#define CORE0_CORE0_LP_SPI_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LP_SPI_INT_MAP_S  0

/** CORE0_LP_TOUCH_INT_MAP_REG register
 *  NA
 */
#define CORE0_LP_TOUCH_INT_MAP_REG (DR_REG_CORE0_BASE + 0x38)
/** CORE0_CORE0_LP_TOUCH_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LP_TOUCH_INT_MAP    0x0000003FU
#define CORE0_CORE0_LP_TOUCH_INT_MAP_M  (CORE0_CORE0_LP_TOUCH_INT_MAP_V << CORE0_CORE0_LP_TOUCH_INT_MAP_S)
#define CORE0_CORE0_LP_TOUCH_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LP_TOUCH_INT_MAP_S  0

