espressif/esp-idf/components/soc/esp32p4/include/soc/core0_interrupt_reg.h
/** CORE0_LP_TSENS_INT_MAP_REG register
 *  NA
 */
#define CORE0_LP_TSENS_INT_MAP_REG (DR_REG_CORE0_BASE + 0x3c)
/** CORE0_CORE0_LP_TSENS_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LP_TSENS_INT_MAP    0x0000003FU
#define CORE0_CORE0_LP_TSENS_INT_MAP_M  (CORE0_CORE0_LP_TSENS_INT_MAP_V << CORE0_CORE0_LP_TSENS_INT_MAP_S)
#define CORE0_CORE0_LP_TSENS_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LP_TSENS_INT_MAP_S  0

/** CORE0_LP_UART_INT_MAP_REG register
 *  NA
 */
#define CORE0_LP_UART_INT_MAP_REG (DR_REG_CORE0_BASE + 0x40)
/** CORE0_CORE0_LP_UART_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LP_UART_INT_MAP    0x0000003FU
#define CORE0_CORE0_LP_UART_INT_MAP_M  (CORE0_CORE0_LP_UART_INT_MAP_V << CORE0_CORE0_LP_UART_INT_MAP_S)
#define CORE0_CORE0_LP_UART_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LP_UART_INT_MAP_S  0

/** CORE0_LP_EFUSE_INT_MAP_REG register
 *  NA
 */
#define CORE0_LP_EFUSE_INT_MAP_REG (DR_REG_CORE0_BASE + 0x44)
/** CORE0_CORE0_LP_EFUSE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LP_EFUSE_INT_MAP    0x0000003FU
#define CORE0_CORE0_LP_EFUSE_INT_MAP_M  (CORE0_CORE0_LP_EFUSE_INT_MAP_V << CORE0_CORE0_LP_EFUSE_INT_MAP_S)
#define CORE0_CORE0_LP_EFUSE_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LP_EFUSE_INT_MAP_S  0

/** CORE0_LP_SW_INT_MAP_REG register
 *  NA
 */
#define CORE0_LP_SW_INT_MAP_REG (DR_REG_CORE0_BASE + 0x48)
/** CORE0_CORE0_LP_SW_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LP_SW_INT_MAP    0x0000003FU
#define CORE0_CORE0_LP_SW_INT_MAP_M  (CORE0_CORE0_LP_SW_INT_MAP_V << CORE0_CORE0_LP_SW_INT_MAP_S)
#define CORE0_CORE0_LP_SW_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LP_SW_INT_MAP_S  0

/** CORE0_LP_SYSREG_INT_MAP_REG register
 *  NA
 */
#define CORE0_LP_SYSREG_INT_MAP_REG (DR_REG_CORE0_BASE + 0x4c)
/** CORE0_CORE0_LP_SYSREG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LP_SYSREG_INT_MAP    0x0000003FU
#define CORE0_CORE0_LP_SYSREG_INT_MAP_M  (CORE0_CORE0_LP_SYSREG_INT_MAP_V << CORE0_CORE0_LP_SYSREG_INT_MAP_S)
#define CORE0_CORE0_LP_SYSREG_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LP_SYSREG_INT_MAP_S  0

/** CORE0_LP_HUK_INT_MAP_REG register
 *  NA
 */
#define CORE0_LP_HUK_INT_MAP_REG (DR_REG_CORE0_BASE + 0x50)
/** CORE0_CORE0_LP_HUK_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LP_HUK_INT_MAP    0x0000003FU
#define CORE0_CORE0_LP_HUK_INT_MAP_M  (CORE0_CORE0_LP_HUK_INT_MAP_V << CORE0_CORE0_LP_HUK_INT_MAP_S)
#define CORE0_CORE0_LP_HUK_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LP_HUK_INT_MAP_S  0

/** CORE0_SYS_ICM_INT_MAP_REG register
 *  NA
 */
#define CORE0_SYS_ICM_INT_MAP_REG (DR_REG_CORE0_BASE + 0x54)
/** CORE0_CORE0_SYS_ICM_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_SYS_ICM_INT_MAP    0x0000003FU
#define CORE0_CORE0_SYS_ICM_INT_MAP_M  (CORE0_CORE0_SYS_ICM_INT_MAP_V << CORE0_CORE0_SYS_ICM_INT_MAP_S)
#define CORE0_CORE0_SYS_ICM_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_SYS_ICM_INT_MAP_S  0

/** CORE0_USB_DEVICE_INT_MAP_REG register
 *  NA
 */
#define CORE0_USB_DEVICE_INT_MAP_REG (DR_REG_CORE0_BASE + 0x58)
/** CORE0_CORE0_USB_DEVICE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_USB_DEVICE_INT_MAP    0x0000003FU
#define CORE0_CORE0_USB_DEVICE_INT_MAP_M  (CORE0_CORE0_USB_DEVICE_INT_MAP_V << CORE0_CORE0_USB_DEVICE_INT_MAP_S)
#define CORE0_CORE0_USB_DEVICE_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_USB_DEVICE_INT_MAP_S  0

/** CORE0_SDIO_HOST_INT_MAP_REG register
 *  NA
 */
#define CORE0_SDIO_HOST_INT_MAP_REG (DR_REG_CORE0_BASE + 0x5c)
/** CORE0_CORE0_SDIO_HOST_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_SDIO_HOST_INT_MAP    0x0000003FU
#define CORE0_CORE0_SDIO_HOST_INT_MAP_M  (CORE0_CORE0_SDIO_HOST_INT_MAP_V << CORE0_CORE0_SDIO_HOST_INT_MAP_S)
#define CORE0_CORE0_SDIO_HOST_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_SDIO_HOST_INT_MAP_S  0

/** CORE0_GDMA_INT_MAP_REG register
 *  NA
 */
#define CORE0_GDMA_INT_MAP_REG (DR_REG_CORE0_BASE + 0x60)
/** CORE0_CORE0_GDMA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_GDMA_INT_MAP    0x0000003FU
#define CORE0_CORE0_GDMA_INT_MAP_M  (CORE0_CORE0_GDMA_INT_MAP_V << CORE0_CORE0_GDMA_INT_MAP_S)
#define CORE0_CORE0_GDMA_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_GDMA_INT_MAP_S  0

/** CORE0_SPI2_INT_MAP_REG register
 *  NA
 */
#define CORE0_SPI2_INT_MAP_REG (DR_REG_CORE0_BASE + 0x64)
/** CORE0_CORE0_SPI2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_SPI2_INT_MAP    0x0000003FU
#define CORE0_CORE0_SPI2_INT_MAP_M  (CORE0_CORE0_SPI2_INT_MAP_V << CORE0_CORE0_SPI2_INT_MAP_S)
#define CORE0_CORE0_SPI2_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_SPI2_INT_MAP_S  0

/** CORE0_SPI3_INT_MAP_REG register
 *  NA
 */
#define CORE0_SPI3_INT_MAP_REG (DR_REG_CORE0_BASE + 0x68)
/** CORE0_CORE0_SPI3_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_SPI3_INT_MAP    0x0000003FU
#define CORE0_CORE0_SPI3_INT_MAP_M  (CORE0_CORE0_SPI3_INT_MAP_V << CORE0_CORE0_SPI3_INT_MAP_S)
#define CORE0_CORE0_SPI3_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_SPI3_INT_MAP_S  0

/** CORE0_I2S0_INT_MAP_REG register
 *  NA
 */
#define CORE0_I2S0_INT_MAP_REG (DR_REG_CORE0_BASE + 0x6c)
/** CORE0_CORE0_I2S0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_I2S0_INT_MAP    0x0000003FU
#define CORE0_CORE0_I2S0_INT_MAP_M  (CORE0_CORE0_I2S0_INT_MAP_V << CORE0_CORE0_I2S0_INT_MAP_S)
#define CORE0_CORE0_I2S0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_I2S0_INT_MAP_S  0

/** CORE0_I2S1_INT_MAP_REG register
 *  NA
 */
#define CORE0_I2S1_INT_MAP_REG (DR_REG_CORE0_BASE + 0x70)
/** CORE0_CORE0_I2S1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_I2S1_INT_MAP    0x0000003FU
#define CORE0_CORE0_I2S1_INT_MAP_M  (CORE0_CORE0_I2S1_INT_MAP_V << CORE0_CORE0_I2S1_INT_MAP_S)
#define CORE0_CORE0_I2S1_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_I2S1_INT_MAP_S  0

