espressif/esp-idf/components/soc/esp32p4/include/soc/core0_interrupt_reg.h
/** CORE0_I2S2_INT_MAP_REG register
 *  NA
 */
#define CORE0_I2S2_INT_MAP_REG (DR_REG_CORE0_BASE + 0x74)
/** CORE0_CORE0_I2S2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_I2S2_INT_MAP    0x0000003FU
#define CORE0_CORE0_I2S2_INT_MAP_M  (CORE0_CORE0_I2S2_INT_MAP_V << CORE0_CORE0_I2S2_INT_MAP_S)
#define CORE0_CORE0_I2S2_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_I2S2_INT_MAP_S  0

/** CORE0_UHCI0_INT_MAP_REG register
 *  NA
 */
#define CORE0_UHCI0_INT_MAP_REG (DR_REG_CORE0_BASE + 0x78)
/** CORE0_CORE0_UHCI0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_UHCI0_INT_MAP    0x0000003FU
#define CORE0_CORE0_UHCI0_INT_MAP_M  (CORE0_CORE0_UHCI0_INT_MAP_V << CORE0_CORE0_UHCI0_INT_MAP_S)
#define CORE0_CORE0_UHCI0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_UHCI0_INT_MAP_S  0

/** CORE0_UART0_INT_MAP_REG register
 *  NA
 */
#define CORE0_UART0_INT_MAP_REG (DR_REG_CORE0_BASE + 0x7c)
/** CORE0_CORE0_UART0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_UART0_INT_MAP    0x0000003FU
#define CORE0_CORE0_UART0_INT_MAP_M  (CORE0_CORE0_UART0_INT_MAP_V << CORE0_CORE0_UART0_INT_MAP_S)
#define CORE0_CORE0_UART0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_UART0_INT_MAP_S  0

/** CORE0_UART1_INT_MAP_REG register
 *  NA
 */
#define CORE0_UART1_INT_MAP_REG (DR_REG_CORE0_BASE + 0x80)
/** CORE0_CORE0_UART1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_UART1_INT_MAP    0x0000003FU
#define CORE0_CORE0_UART1_INT_MAP_M  (CORE0_CORE0_UART1_INT_MAP_V << CORE0_CORE0_UART1_INT_MAP_S)
#define CORE0_CORE0_UART1_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_UART1_INT_MAP_S  0

/** CORE0_UART2_INT_MAP_REG register
 *  NA
 */
#define CORE0_UART2_INT_MAP_REG (DR_REG_CORE0_BASE + 0x84)
/** CORE0_CORE0_UART2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_UART2_INT_MAP    0x0000003FU
#define CORE0_CORE0_UART2_INT_MAP_M  (CORE0_CORE0_UART2_INT_MAP_V << CORE0_CORE0_UART2_INT_MAP_S)
#define CORE0_CORE0_UART2_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_UART2_INT_MAP_S  0

/** CORE0_UART3_INT_MAP_REG register
 *  NA
 */
#define CORE0_UART3_INT_MAP_REG (DR_REG_CORE0_BASE + 0x88)
/** CORE0_CORE0_UART3_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_UART3_INT_MAP    0x0000003FU
#define CORE0_CORE0_UART3_INT_MAP_M  (CORE0_CORE0_UART3_INT_MAP_V << CORE0_CORE0_UART3_INT_MAP_S)
#define CORE0_CORE0_UART3_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_UART3_INT_MAP_S  0

/** CORE0_UART4_INT_MAP_REG register
 *  NA
 */
#define CORE0_UART4_INT_MAP_REG (DR_REG_CORE0_BASE + 0x8c)
/** CORE0_CORE0_UART4_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_UART4_INT_MAP    0x0000003FU
#define CORE0_CORE0_UART4_INT_MAP_M  (CORE0_CORE0_UART4_INT_MAP_V << CORE0_CORE0_UART4_INT_MAP_S)
#define CORE0_CORE0_UART4_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_UART4_INT_MAP_S  0

/** CORE0_LCD_CAM_INT_MAP_REG register
 *  NA
 */
#define CORE0_LCD_CAM_INT_MAP_REG (DR_REG_CORE0_BASE + 0x90)
/** CORE0_CORE0_LCD_CAM_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LCD_CAM_INT_MAP    0x0000003FU
#define CORE0_CORE0_LCD_CAM_INT_MAP_M  (CORE0_CORE0_LCD_CAM_INT_MAP_V << CORE0_CORE0_LCD_CAM_INT_MAP_S)
#define CORE0_CORE0_LCD_CAM_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LCD_CAM_INT_MAP_S  0

/** CORE0_ADC_INT_MAP_REG register
 *  NA
 */
#define CORE0_ADC_INT_MAP_REG (DR_REG_CORE0_BASE + 0x94)
/** CORE0_CORE0_ADC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_ADC_INT_MAP    0x0000003FU
#define CORE0_CORE0_ADC_INT_MAP_M  (CORE0_CORE0_ADC_INT_MAP_V << CORE0_CORE0_ADC_INT_MAP_S)
#define CORE0_CORE0_ADC_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_ADC_INT_MAP_S  0

/** CORE0_PWM0_INT_MAP_REG register
 *  NA
 */
#define CORE0_PWM0_INT_MAP_REG (DR_REG_CORE0_BASE + 0x98)
/** CORE0_CORE0_PWM0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_PWM0_INT_MAP    0x0000003FU
#define CORE0_CORE0_PWM0_INT_MAP_M  (CORE0_CORE0_PWM0_INT_MAP_V << CORE0_CORE0_PWM0_INT_MAP_S)
#define CORE0_CORE0_PWM0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_PWM0_INT_MAP_S  0

/** CORE0_PWM1_INT_MAP_REG register
 *  NA
 */
#define CORE0_PWM1_INT_MAP_REG (DR_REG_CORE0_BASE + 0x9c)
/** CORE0_CORE0_PWM1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_PWM1_INT_MAP    0x0000003FU
#define CORE0_CORE0_PWM1_INT_MAP_M  (CORE0_CORE0_PWM1_INT_MAP_V << CORE0_CORE0_PWM1_INT_MAP_S)
#define CORE0_CORE0_PWM1_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_PWM1_INT_MAP_S  0

/** CORE0_CAN0_INT_MAP_REG register
 *  NA
 */
#define CORE0_CAN0_INT_MAP_REG (DR_REG_CORE0_BASE + 0xa0)
/** CORE0_CORE0_CAN0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_CAN0_INT_MAP    0x0000003FU
#define CORE0_CORE0_CAN0_INT_MAP_M  (CORE0_CORE0_CAN0_INT_MAP_V << CORE0_CORE0_CAN0_INT_MAP_S)
#define CORE0_CORE0_CAN0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_CAN0_INT_MAP_S  0

/** CORE0_CAN1_INT_MAP_REG register
 *  NA
 */
#define CORE0_CAN1_INT_MAP_REG (DR_REG_CORE0_BASE + 0xa4)
/** CORE0_CORE0_CAN1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_CAN1_INT_MAP    0x0000003FU
#define CORE0_CORE0_CAN1_INT_MAP_M  (CORE0_CORE0_CAN1_INT_MAP_V << CORE0_CORE0_CAN1_INT_MAP_S)
#define CORE0_CORE0_CAN1_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_CAN1_INT_MAP_S  0

/** CORE0_CAN2_INT_MAP_REG register
 *  NA
 */
#define CORE0_CAN2_INT_MAP_REG (DR_REG_CORE0_BASE + 0xa8)
/** CORE0_CORE0_CAN2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_CAN2_INT_MAP    0x0000003FU
#define CORE0_CORE0_CAN2_INT_MAP_M  (CORE0_CORE0_CAN2_INT_MAP_V << CORE0_CORE0_CAN2_INT_MAP_S)
#define CORE0_CORE0_CAN2_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_CAN2_INT_MAP_S  0

/** CORE0_RMT_INT_MAP_REG register
 *  NA
 */
#define CORE0_RMT_INT_MAP_REG (DR_REG_CORE0_BASE + 0xac)
/** CORE0_CORE0_RMT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_RMT_INT_MAP    0x0000003FU
#define CORE0_CORE0_RMT_INT_MAP_M  (CORE0_CORE0_RMT_INT_MAP_V << CORE0_CORE0_RMT_INT_MAP_S)
#define CORE0_CORE0_RMT_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_RMT_INT_MAP_S  0

