espressif/esp-idf/components/soc/esp32p4/include/soc/core0_interrupt_reg.h
/** CORE0_I2C0_INT_MAP_REG register
 *  NA
 */
#define CORE0_I2C0_INT_MAP_REG (DR_REG_CORE0_BASE + 0xb0)
/** CORE0_CORE0_I2C0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_I2C0_INT_MAP    0x0000003FU
#define CORE0_CORE0_I2C0_INT_MAP_M  (CORE0_CORE0_I2C0_INT_MAP_V << CORE0_CORE0_I2C0_INT_MAP_S)
#define CORE0_CORE0_I2C0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_I2C0_INT_MAP_S  0

/** CORE0_I2C1_INT_MAP_REG register
 *  NA
 */
#define CORE0_I2C1_INT_MAP_REG (DR_REG_CORE0_BASE + 0xb4)
/** CORE0_CORE0_I2C1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_I2C1_INT_MAP    0x0000003FU
#define CORE0_CORE0_I2C1_INT_MAP_M  (CORE0_CORE0_I2C1_INT_MAP_V << CORE0_CORE0_I2C1_INT_MAP_S)
#define CORE0_CORE0_I2C1_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_I2C1_INT_MAP_S  0

/** CORE0_TIMERGRP0_T0_INT_MAP_REG register
 *  NA
 */
#define CORE0_TIMERGRP0_T0_INT_MAP_REG (DR_REG_CORE0_BASE + 0xb8)
/** CORE0_CORE0_TIMERGRP0_T0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_TIMERGRP0_T0_INT_MAP    0x0000003FU
#define CORE0_CORE0_TIMERGRP0_T0_INT_MAP_M  (CORE0_CORE0_TIMERGRP0_T0_INT_MAP_V << CORE0_CORE0_TIMERGRP0_T0_INT_MAP_S)
#define CORE0_CORE0_TIMERGRP0_T0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_TIMERGRP0_T0_INT_MAP_S  0

/** CORE0_TIMERGRP0_T1_INT_MAP_REG register
 *  NA
 */
#define CORE0_TIMERGRP0_T1_INT_MAP_REG (DR_REG_CORE0_BASE + 0xbc)
/** CORE0_CORE0_TIMERGRP0_T1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_TIMERGRP0_T1_INT_MAP    0x0000003FU
#define CORE0_CORE0_TIMERGRP0_T1_INT_MAP_M  (CORE0_CORE0_TIMERGRP0_T1_INT_MAP_V << CORE0_CORE0_TIMERGRP0_T1_INT_MAP_S)
#define CORE0_CORE0_TIMERGRP0_T1_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_TIMERGRP0_T1_INT_MAP_S  0

/** CORE0_TIMERGRP0_WDT_INT_MAP_REG register
 *  NA
 */
#define CORE0_TIMERGRP0_WDT_INT_MAP_REG (DR_REG_CORE0_BASE + 0xc0)
/** CORE0_CORE0_TIMERGRP0_WDT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_TIMERGRP0_WDT_INT_MAP    0x0000003FU
#define CORE0_CORE0_TIMERGRP0_WDT_INT_MAP_M  (CORE0_CORE0_TIMERGRP0_WDT_INT_MAP_V << CORE0_CORE0_TIMERGRP0_WDT_INT_MAP_S)
#define CORE0_CORE0_TIMERGRP0_WDT_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_TIMERGRP0_WDT_INT_MAP_S  0

/** CORE0_TIMERGRP1_T0_INT_MAP_REG register
 *  NA
 */
#define CORE0_TIMERGRP1_T0_INT_MAP_REG (DR_REG_CORE0_BASE + 0xc4)
/** CORE0_CORE0_TIMERGRP1_T0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_TIMERGRP1_T0_INT_MAP    0x0000003FU
#define CORE0_CORE0_TIMERGRP1_T0_INT_MAP_M  (CORE0_CORE0_TIMERGRP1_T0_INT_MAP_V << CORE0_CORE0_TIMERGRP1_T0_INT_MAP_S)
#define CORE0_CORE0_TIMERGRP1_T0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_TIMERGRP1_T0_INT_MAP_S  0

/** CORE0_TIMERGRP1_T1_INT_MAP_REG register
 *  NA
 */
#define CORE0_TIMERGRP1_T1_INT_MAP_REG (DR_REG_CORE0_BASE + 0xc8)
/** CORE0_CORE0_TIMERGRP1_T1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_TIMERGRP1_T1_INT_MAP    0x0000003FU
#define CORE0_CORE0_TIMERGRP1_T1_INT_MAP_M  (CORE0_CORE0_TIMERGRP1_T1_INT_MAP_V << CORE0_CORE0_TIMERGRP1_T1_INT_MAP_S)
#define CORE0_CORE0_TIMERGRP1_T1_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_TIMERGRP1_T1_INT_MAP_S  0

/** CORE0_TIMERGRP1_WDT_INT_MAP_REG register
 *  NA
 */
#define CORE0_TIMERGRP1_WDT_INT_MAP_REG (DR_REG_CORE0_BASE + 0xcc)
/** CORE0_CORE0_TIMERGRP1_WDT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_TIMERGRP1_WDT_INT_MAP    0x0000003FU
#define CORE0_CORE0_TIMERGRP1_WDT_INT_MAP_M  (CORE0_CORE0_TIMERGRP1_WDT_INT_MAP_V << CORE0_CORE0_TIMERGRP1_WDT_INT_MAP_S)
#define CORE0_CORE0_TIMERGRP1_WDT_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_TIMERGRP1_WDT_INT_MAP_S  0

/** CORE0_LEDC_INT_MAP_REG register
 *  NA
 */
#define CORE0_LEDC_INT_MAP_REG (DR_REG_CORE0_BASE + 0xd0)
/** CORE0_CORE0_LEDC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LEDC_INT_MAP    0x0000003FU
#define CORE0_CORE0_LEDC_INT_MAP_M  (CORE0_CORE0_LEDC_INT_MAP_V << CORE0_CORE0_LEDC_INT_MAP_S)
#define CORE0_CORE0_LEDC_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LEDC_INT_MAP_S  0

/** CORE0_SYSTIMER_TARGET0_INT_MAP_REG register
 *  NA
 */
#define CORE0_SYSTIMER_TARGET0_INT_MAP_REG (DR_REG_CORE0_BASE + 0xd4)
/** CORE0_CORE0_SYSTIMER_TARGET0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_SYSTIMER_TARGET0_INT_MAP    0x0000003FU
#define CORE0_CORE0_SYSTIMER_TARGET0_INT_MAP_M  (CORE0_CORE0_SYSTIMER_TARGET0_INT_MAP_V << CORE0_CORE0_SYSTIMER_TARGET0_INT_MAP_S)
#define CORE0_CORE0_SYSTIMER_TARGET0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_SYSTIMER_TARGET0_INT_MAP_S  0

/** CORE0_SYSTIMER_TARGET1_INT_MAP_REG register
 *  NA
 */
#define CORE0_SYSTIMER_TARGET1_INT_MAP_REG (DR_REG_CORE0_BASE + 0xd8)
/** CORE0_CORE0_SYSTIMER_TARGET1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_SYSTIMER_TARGET1_INT_MAP    0x0000003FU
#define CORE0_CORE0_SYSTIMER_TARGET1_INT_MAP_M  (CORE0_CORE0_SYSTIMER_TARGET1_INT_MAP_V << CORE0_CORE0_SYSTIMER_TARGET1_INT_MAP_S)
#define CORE0_CORE0_SYSTIMER_TARGET1_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_SYSTIMER_TARGET1_INT_MAP_S  0

/** CORE0_SYSTIMER_TARGET2_INT_MAP_REG register
 *  NA
 */
#define CORE0_SYSTIMER_TARGET2_INT_MAP_REG (DR_REG_CORE0_BASE + 0xdc)
/** CORE0_CORE0_SYSTIMER_TARGET2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_SYSTIMER_TARGET2_INT_MAP    0x0000003FU
#define CORE0_CORE0_SYSTIMER_TARGET2_INT_MAP_M  (CORE0_CORE0_SYSTIMER_TARGET2_INT_MAP_V << CORE0_CORE0_SYSTIMER_TARGET2_INT_MAP_S)
#define CORE0_CORE0_SYSTIMER_TARGET2_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_SYSTIMER_TARGET2_INT_MAP_S  0

/** CORE0_AHB_PDMA_IN_CH0_INT_MAP_REG register
 *  NA
 */
#define CORE0_AHB_PDMA_IN_CH0_INT_MAP_REG (DR_REG_CORE0_BASE + 0xe0)
/** CORE0_CORE0_AHB_PDMA_IN_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_AHB_PDMA_IN_CH0_INT_MAP    0x0000003FU
#define CORE0_CORE0_AHB_PDMA_IN_CH0_INT_MAP_M  (CORE0_CORE0_AHB_PDMA_IN_CH0_INT_MAP_V << CORE0_CORE0_AHB_PDMA_IN_CH0_INT_MAP_S)
#define CORE0_CORE0_AHB_PDMA_IN_CH0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_AHB_PDMA_IN_CH0_INT_MAP_S  0

/** CORE0_AHB_PDMA_IN_CH1_INT_MAP_REG register
 *  NA
 */
#define CORE0_AHB_PDMA_IN_CH1_INT_MAP_REG (DR_REG_CORE0_BASE + 0xe4)
/** CORE0_CORE0_AHB_PDMA_IN_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_AHB_PDMA_IN_CH1_INT_MAP    0x0000003FU
#define CORE0_CORE0_AHB_PDMA_IN_CH1_INT_MAP_M  (CORE0_CORE0_AHB_PDMA_IN_CH1_INT_MAP_V << CORE0_CORE0_AHB_PDMA_IN_CH1_INT_MAP_S)
#define CORE0_CORE0_AHB_PDMA_IN_CH1_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_AHB_PDMA_IN_CH1_INT_MAP_S  0

/** CORE0_AHB_PDMA_IN_CH2_INT_MAP_REG register
 *  NA
 */
#define CORE0_AHB_PDMA_IN_CH2_INT_MAP_REG (DR_REG_CORE0_BASE + 0xe8)
/** CORE0_CORE0_AHB_PDMA_IN_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_AHB_PDMA_IN_CH2_INT_MAP    0x0000003FU
#define CORE0_CORE0_AHB_PDMA_IN_CH2_INT_MAP_M  (CORE0_CORE0_AHB_PDMA_IN_CH2_INT_MAP_V << CORE0_CORE0_AHB_PDMA_IN_CH2_INT_MAP_S)
#define CORE0_CORE0_AHB_PDMA_IN_CH2_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_AHB_PDMA_IN_CH2_INT_MAP_S  0

/** CORE0_AHB_PDMA_OUT_CH0_INT_MAP_REG register
 *  NA
 */
#define CORE0_AHB_PDMA_OUT_CH0_INT_MAP_REG (DR_REG_CORE0_BASE + 0xec)
/** CORE0_CORE0_AHB_PDMA_OUT_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_AHB_PDMA_OUT_CH0_INT_MAP    0x0000003FU
#define CORE0_CORE0_AHB_PDMA_OUT_CH0_INT_MAP_M  (CORE0_CORE0_AHB_PDMA_OUT_CH0_INT_MAP_V << CORE0_CORE0_AHB_PDMA_OUT_CH0_INT_MAP_S)
#define CORE0_CORE0_AHB_PDMA_OUT_CH0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_AHB_PDMA_OUT_CH0_INT_MAP_S  0

/** CORE0_AHB_PDMA_OUT_CH1_INT_MAP_REG register
 *  NA
 */
#define CORE0_AHB_PDMA_OUT_CH1_INT_MAP_REG (DR_REG_CORE0_BASE + 0xf0)
/** CORE0_CORE0_AHB_PDMA_OUT_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_AHB_PDMA_OUT_CH1_INT_MAP    0x0000003FU
#define CORE0_CORE0_AHB_PDMA_OUT_CH1_INT_MAP_M  (CORE0_CORE0_AHB_PDMA_OUT_CH1_INT_MAP_V << CORE0_CORE0_AHB_PDMA_OUT_CH1_INT_MAP_S)
#define CORE0_CORE0_AHB_PDMA_OUT_CH1_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_AHB_PDMA_OUT_CH1_INT_MAP_S  0

/** CORE0_AHB_PDMA_OUT_CH2_INT_MAP_REG register
 *  NA
 */
#define CORE0_AHB_PDMA_OUT_CH2_INT_MAP_REG (DR_REG_CORE0_BASE + 0xf4)
/** CORE0_CORE0_AHB_PDMA_OUT_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_AHB_PDMA_OUT_CH2_INT_MAP    0x0000003FU
#define CORE0_CORE0_AHB_PDMA_OUT_CH2_INT_MAP_M  (CORE0_CORE0_AHB_PDMA_OUT_CH2_INT_MAP_V << CORE0_CORE0_AHB_PDMA_OUT_CH2_INT_MAP_S)
#define CORE0_CORE0_AHB_PDMA_OUT_CH2_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_AHB_PDMA_OUT_CH2_INT_MAP_S  0

/** CORE0_AXI_PDMA_IN_CH0_INT_MAP_REG register
 *  NA
 */
#define CORE0_AXI_PDMA_IN_CH0_INT_MAP_REG (DR_REG_CORE0_BASE + 0xf8)
/** CORE0_CORE0_AXI_PDMA_IN_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_AXI_PDMA_IN_CH0_INT_MAP    0x0000003FU
#define CORE0_CORE0_AXI_PDMA_IN_CH0_INT_MAP_M  (CORE0_CORE0_AXI_PDMA_IN_CH0_INT_MAP_V << CORE0_CORE0_AXI_PDMA_IN_CH0_INT_MAP_S)
#define CORE0_CORE0_AXI_PDMA_IN_CH0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_AXI_PDMA_IN_CH0_INT_MAP_S  0

/** CORE0_AXI_PDMA_IN_CH1_INT_MAP_REG register
 *  NA
 */
#define CORE0_AXI_PDMA_IN_CH1_INT_MAP_REG (DR_REG_CORE0_BASE + 0xfc)
/** CORE0_CORE0_AXI_PDMA_IN_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_AXI_PDMA_IN_CH1_INT_MAP    0x0000003FU
#define CORE0_CORE0_AXI_PDMA_IN_CH1_INT_MAP_M  (CORE0_CORE0_AXI_PDMA_IN_CH1_INT_MAP_V << CORE0_CORE0_AXI_PDMA_IN_CH1_INT_MAP_S)
#define CORE0_CORE0_AXI_PDMA_IN_CH1_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_AXI_PDMA_IN_CH1_INT_MAP_S  0

/** CORE0_AXI_PDMA_IN_CH2_INT_MAP_REG register
 *  NA
 */
#define CORE0_AXI_PDMA_IN_CH2_INT_MAP_REG (DR_REG_CORE0_BASE + 0x100)
/** CORE0_CORE0_AXI_PDMA_IN_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_AXI_PDMA_IN_CH2_INT_MAP    0x0000003FU
#define CORE0_CORE0_AXI_PDMA_IN_CH2_INT_MAP_M  (CORE0_CORE0_AXI_PDMA_IN_CH2_INT_MAP_V << CORE0_CORE0_AXI_PDMA_IN_CH2_INT_MAP_S)
#define CORE0_CORE0_AXI_PDMA_IN_CH2_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_AXI_PDMA_IN_CH2_INT_MAP_S  0

/** CORE0_AXI_PDMA_OUT_CH0_INT_MAP_REG register
 *  NA
 */
#define CORE0_AXI_PDMA_OUT_CH0_INT_MAP_REG (DR_REG_CORE0_BASE + 0x104)
/** CORE0_CORE0_AXI_PDMA_OUT_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_AXI_PDMA_OUT_CH0_INT_MAP    0x0000003FU
#define CORE0_CORE0_AXI_PDMA_OUT_CH0_INT_MAP_M  (CORE0_CORE0_AXI_PDMA_OUT_CH0_INT_MAP_V << CORE0_CORE0_AXI_PDMA_OUT_CH0_INT_MAP_S)
#define CORE0_CORE0_AXI_PDMA_OUT_CH0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_AXI_PDMA_OUT_CH0_INT_MAP_S  0

/** CORE0_AXI_PDMA_OUT_CH1_INT_MAP_REG register
 *  NA
 */
#define CORE0_AXI_PDMA_OUT_CH1_INT_MAP_REG (DR_REG_CORE0_BASE + 0x108)
/** CORE0_CORE0_AXI_PDMA_OUT_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_AXI_PDMA_OUT_CH1_INT_MAP    0x0000003FU
#define CORE0_CORE0_AXI_PDMA_OUT_CH1_INT_MAP_M  (CORE0_CORE0_AXI_PDMA_OUT_CH1_INT_MAP_V << CORE0_CORE0_AXI_PDMA_OUT_CH1_INT_MAP_S)
#define CORE0_CORE0_AXI_PDMA_OUT_CH1_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_AXI_PDMA_OUT_CH1_INT_MAP_S  0

/** CORE0_AXI_PDMA_OUT_CH2_INT_MAP_REG register
 *  NA
 */
#define CORE0_AXI_PDMA_OUT_CH2_INT_MAP_REG (DR_REG_CORE0_BASE + 0x10c)
/** CORE0_CORE0_AXI_PDMA_OUT_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_AXI_PDMA_OUT_CH2_INT_MAP    0x0000003FU
#define CORE0_CORE0_AXI_PDMA_OUT_CH2_INT_MAP_M  (CORE0_CORE0_AXI_PDMA_OUT_CH2_INT_MAP_V << CORE0_CORE0_AXI_PDMA_OUT_CH2_INT_MAP_S)
#define CORE0_CORE0_AXI_PDMA_OUT_CH2_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_AXI_PDMA_OUT_CH2_INT_MAP_S  0

/** CORE0_RSA_INT_MAP_REG register
 *  NA
 */
#define CORE0_RSA_INT_MAP_REG (DR_REG_CORE0_BASE + 0x110)
/** CORE0_CORE0_RSA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_RSA_INT_MAP    0x0000003FU
#define CORE0_CORE0_RSA_INT_MAP_M  (CORE0_CORE0_RSA_INT_MAP_V << CORE0_CORE0_RSA_INT_MAP_S)
#define CORE0_CORE0_RSA_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_RSA_INT_MAP_S  0

