espressif/esp-idf/components/soc/esp32p4/include/soc/core0_interrupt_reg.h
/** CORE0_AES_INT_MAP_REG register
 *  NA
 */
#define CORE0_AES_INT_MAP_REG (DR_REG_CORE0_BASE + 0x114)
/** CORE0_CORE0_AES_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_AES_INT_MAP    0x0000003FU
#define CORE0_CORE0_AES_INT_MAP_M  (CORE0_CORE0_AES_INT_MAP_V << CORE0_CORE0_AES_INT_MAP_S)
#define CORE0_CORE0_AES_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_AES_INT_MAP_S  0

/** CORE0_SHA_INT_MAP_REG register
 *  NA
 */
#define CORE0_SHA_INT_MAP_REG (DR_REG_CORE0_BASE + 0x118)
/** CORE0_CORE0_SHA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_SHA_INT_MAP    0x0000003FU
#define CORE0_CORE0_SHA_INT_MAP_M  (CORE0_CORE0_SHA_INT_MAP_V << CORE0_CORE0_SHA_INT_MAP_S)
#define CORE0_CORE0_SHA_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_SHA_INT_MAP_S  0

/** CORE0_ECC_INT_MAP_REG register
 *  NA
 */
#define CORE0_ECC_INT_MAP_REG (DR_REG_CORE0_BASE + 0x11c)
/** CORE0_CORE0_ECC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_ECC_INT_MAP    0x0000003FU
#define CORE0_CORE0_ECC_INT_MAP_M  (CORE0_CORE0_ECC_INT_MAP_V << CORE0_CORE0_ECC_INT_MAP_S)
#define CORE0_CORE0_ECC_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_ECC_INT_MAP_S  0

/** CORE0_ECDSA_INT_MAP_REG register
 *  NA
 */
#define CORE0_ECDSA_INT_MAP_REG (DR_REG_CORE0_BASE + 0x120)
/** CORE0_CORE0_ECDSA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_ECDSA_INT_MAP    0x0000003FU
#define CORE0_CORE0_ECDSA_INT_MAP_M  (CORE0_CORE0_ECDSA_INT_MAP_V << CORE0_CORE0_ECDSA_INT_MAP_S)
#define CORE0_CORE0_ECDSA_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_ECDSA_INT_MAP_S  0

/** CORE0_KM_INT_MAP_REG register
 *  NA
 */
#define CORE0_KM_INT_MAP_REG (DR_REG_CORE0_BASE + 0x124)
/** CORE0_CORE0_KM_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_KM_INT_MAP    0x0000003FU
#define CORE0_CORE0_KM_INT_MAP_M  (CORE0_CORE0_KM_INT_MAP_V << CORE0_CORE0_KM_INT_MAP_S)
#define CORE0_CORE0_KM_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_KM_INT_MAP_S  0

/** CORE0_GPIO_INT0_MAP_REG register
 *  NA
 */
#define CORE0_GPIO_INT0_MAP_REG (DR_REG_CORE0_BASE + 0x128)
/** CORE0_CORE0_GPIO_INT0_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_GPIO_INT0_MAP    0x0000003FU
#define CORE0_CORE0_GPIO_INT0_MAP_M  (CORE0_CORE0_GPIO_INT0_MAP_V << CORE0_CORE0_GPIO_INT0_MAP_S)
#define CORE0_CORE0_GPIO_INT0_MAP_V  0x0000003FU
#define CORE0_CORE0_GPIO_INT0_MAP_S  0

/** CORE0_GPIO_INT1_MAP_REG register
 *  NA
 */
#define CORE0_GPIO_INT1_MAP_REG (DR_REG_CORE0_BASE + 0x12c)
/** CORE0_CORE0_GPIO_INT1_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_GPIO_INT1_MAP    0x0000003FU
#define CORE0_CORE0_GPIO_INT1_MAP_M  (CORE0_CORE0_GPIO_INT1_MAP_V << CORE0_CORE0_GPIO_INT1_MAP_S)
#define CORE0_CORE0_GPIO_INT1_MAP_V  0x0000003FU
#define CORE0_CORE0_GPIO_INT1_MAP_S  0

/** CORE0_GPIO_INT2_MAP_REG register
 *  NA
 */
#define CORE0_GPIO_INT2_MAP_REG (DR_REG_CORE0_BASE + 0x130)
/** CORE0_CORE0_GPIO_INT2_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_GPIO_INT2_MAP    0x0000003FU
#define CORE0_CORE0_GPIO_INT2_MAP_M  (CORE0_CORE0_GPIO_INT2_MAP_V << CORE0_CORE0_GPIO_INT2_MAP_S)
#define CORE0_CORE0_GPIO_INT2_MAP_V  0x0000003FU
#define CORE0_CORE0_GPIO_INT2_MAP_S  0

/** CORE0_GPIO_INT3_MAP_REG register
 *  NA
 */
#define CORE0_GPIO_INT3_MAP_REG (DR_REG_CORE0_BASE + 0x134)
/** CORE0_CORE0_GPIO_INT3_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_GPIO_INT3_MAP    0x0000003FU
#define CORE0_CORE0_GPIO_INT3_MAP_M  (CORE0_CORE0_GPIO_INT3_MAP_V << CORE0_CORE0_GPIO_INT3_MAP_S)
#define CORE0_CORE0_GPIO_INT3_MAP_V  0x0000003FU
#define CORE0_CORE0_GPIO_INT3_MAP_S  0

/** CORE0_GPIO_PAD_COMP_INT_MAP_REG register
 *  NA
 */
#define CORE0_GPIO_PAD_COMP_INT_MAP_REG (DR_REG_CORE0_BASE + 0x138)
/** CORE0_CORE0_GPIO_PAD_COMP_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_GPIO_PAD_COMP_INT_MAP    0x0000003FU
#define CORE0_CORE0_GPIO_PAD_COMP_INT_MAP_M  (CORE0_CORE0_GPIO_PAD_COMP_INT_MAP_V << CORE0_CORE0_GPIO_PAD_COMP_INT_MAP_S)
#define CORE0_CORE0_GPIO_PAD_COMP_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_GPIO_PAD_COMP_INT_MAP_S  0

/** CORE0_CPU_INT_FROM_CPU_0_MAP_REG register
 *  NA
 */
#define CORE0_CPU_INT_FROM_CPU_0_MAP_REG (DR_REG_CORE0_BASE + 0x13c)
/** CORE0_CORE0_CPU_INT_FROM_CPU_0_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_CPU_INT_FROM_CPU_0_MAP    0x0000003FU
#define CORE0_CORE0_CPU_INT_FROM_CPU_0_MAP_M  (CORE0_CORE0_CPU_INT_FROM_CPU_0_MAP_V << CORE0_CORE0_CPU_INT_FROM_CPU_0_MAP_S)
#define CORE0_CORE0_CPU_INT_FROM_CPU_0_MAP_V  0x0000003FU
#define CORE0_CORE0_CPU_INT_FROM_CPU_0_MAP_S  0

/** CORE0_CPU_INT_FROM_CPU_1_MAP_REG register
 *  NA
 */
#define CORE0_CPU_INT_FROM_CPU_1_MAP_REG (DR_REG_CORE0_BASE + 0x140)
/** CORE0_CORE0_CPU_INT_FROM_CPU_1_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_CPU_INT_FROM_CPU_1_MAP    0x0000003FU
#define CORE0_CORE0_CPU_INT_FROM_CPU_1_MAP_M  (CORE0_CORE0_CPU_INT_FROM_CPU_1_MAP_V << CORE0_CORE0_CPU_INT_FROM_CPU_1_MAP_S)
#define CORE0_CORE0_CPU_INT_FROM_CPU_1_MAP_V  0x0000003FU
#define CORE0_CORE0_CPU_INT_FROM_CPU_1_MAP_S  0

/** CORE0_CPU_INT_FROM_CPU_2_MAP_REG register
 *  NA
 */
#define CORE0_CPU_INT_FROM_CPU_2_MAP_REG (DR_REG_CORE0_BASE + 0x144)
/** CORE0_CORE0_CPU_INT_FROM_CPU_2_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_CPU_INT_FROM_CPU_2_MAP    0x0000003FU
#define CORE0_CORE0_CPU_INT_FROM_CPU_2_MAP_M  (CORE0_CORE0_CPU_INT_FROM_CPU_2_MAP_V << CORE0_CORE0_CPU_INT_FROM_CPU_2_MAP_S)
#define CORE0_CORE0_CPU_INT_FROM_CPU_2_MAP_V  0x0000003FU
#define CORE0_CORE0_CPU_INT_FROM_CPU_2_MAP_S  0

/** CORE0_CPU_INT_FROM_CPU_3_MAP_REG register
 *  NA
 */
#define CORE0_CPU_INT_FROM_CPU_3_MAP_REG (DR_REG_CORE0_BASE + 0x148)
/** CORE0_CORE0_CPU_INT_FROM_CPU_3_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_CPU_INT_FROM_CPU_3_MAP    0x0000003FU
#define CORE0_CORE0_CPU_INT_FROM_CPU_3_MAP_M  (CORE0_CORE0_CPU_INT_FROM_CPU_3_MAP_V << CORE0_CORE0_CPU_INT_FROM_CPU_3_MAP_S)
#define CORE0_CORE0_CPU_INT_FROM_CPU_3_MAP_V  0x0000003FU
#define CORE0_CORE0_CPU_INT_FROM_CPU_3_MAP_S  0

/** CORE0_CACHE_INT_MAP_REG register
 *  NA
 */
#define CORE0_CACHE_INT_MAP_REG (DR_REG_CORE0_BASE + 0x14c)
/** CORE0_CORE0_CACHE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_CACHE_INT_MAP    0x0000003FU
#define CORE0_CORE0_CACHE_INT_MAP_M  (CORE0_CORE0_CACHE_INT_MAP_V << CORE0_CORE0_CACHE_INT_MAP_S)
#define CORE0_CORE0_CACHE_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_CACHE_INT_MAP_S  0

/** CORE0_FLASH_MSPI_INT_MAP_REG register
 *  NA
 */
#define CORE0_FLASH_MSPI_INT_MAP_REG (DR_REG_CORE0_BASE + 0x150)
/** CORE0_CORE0_FLASH_MSPI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_FLASH_MSPI_INT_MAP    0x0000003FU
#define CORE0_CORE0_FLASH_MSPI_INT_MAP_M  (CORE0_CORE0_FLASH_MSPI_INT_MAP_V << CORE0_CORE0_FLASH_MSPI_INT_MAP_S)
#define CORE0_CORE0_FLASH_MSPI_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_FLASH_MSPI_INT_MAP_S  0

