espressif/esp-idf/components/soc/esp32p4/include/soc/core0_interrupt_reg.h
/** CORE0_CSI_BRIDGE_INT_MAP_REG register
 *  NA
 */
#define CORE0_CSI_BRIDGE_INT_MAP_REG (DR_REG_CORE0_BASE + 0x154)
/** CORE0_CORE0_CSI_BRIDGE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_CSI_BRIDGE_INT_MAP    0x0000003FU
#define CORE0_CORE0_CSI_BRIDGE_INT_MAP_M  (CORE0_CORE0_CSI_BRIDGE_INT_MAP_V << CORE0_CORE0_CSI_BRIDGE_INT_MAP_S)
#define CORE0_CORE0_CSI_BRIDGE_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_CSI_BRIDGE_INT_MAP_S  0

/** CORE0_DSI_BRIDGE_INT_MAP_REG register
 *  NA
 */
#define CORE0_DSI_BRIDGE_INT_MAP_REG (DR_REG_CORE0_BASE + 0x158)
/** CORE0_CORE0_DSI_BRIDGE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_DSI_BRIDGE_INT_MAP    0x0000003FU
#define CORE0_CORE0_DSI_BRIDGE_INT_MAP_M  (CORE0_CORE0_DSI_BRIDGE_INT_MAP_V << CORE0_CORE0_DSI_BRIDGE_INT_MAP_S)
#define CORE0_CORE0_DSI_BRIDGE_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_DSI_BRIDGE_INT_MAP_S  0

/** CORE0_CSI_INT_MAP_REG register
 *  NA
 */
#define CORE0_CSI_INT_MAP_REG (DR_REG_CORE0_BASE + 0x15c)
/** CORE0_CORE0_CSI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_CSI_INT_MAP    0x0000003FU
#define CORE0_CORE0_CSI_INT_MAP_M  (CORE0_CORE0_CSI_INT_MAP_V << CORE0_CORE0_CSI_INT_MAP_S)
#define CORE0_CORE0_CSI_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_CSI_INT_MAP_S  0

/** CORE0_DSI_INT_MAP_REG register
 *  NA
 */
#define CORE0_DSI_INT_MAP_REG (DR_REG_CORE0_BASE + 0x160)
/** CORE0_CORE0_DSI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_DSI_INT_MAP    0x0000003FU
#define CORE0_CORE0_DSI_INT_MAP_M  (CORE0_CORE0_DSI_INT_MAP_V << CORE0_CORE0_DSI_INT_MAP_S)
#define CORE0_CORE0_DSI_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_DSI_INT_MAP_S  0

/** CORE0_GMII_PHY_INT_MAP_REG register
 *  NA
 */
#define CORE0_GMII_PHY_INT_MAP_REG (DR_REG_CORE0_BASE + 0x164)
/** CORE0_CORE0_GMII_PHY_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_GMII_PHY_INT_MAP    0x0000003FU
#define CORE0_CORE0_GMII_PHY_INT_MAP_M  (CORE0_CORE0_GMII_PHY_INT_MAP_V << CORE0_CORE0_GMII_PHY_INT_MAP_S)
#define CORE0_CORE0_GMII_PHY_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_GMII_PHY_INT_MAP_S  0

/** CORE0_LPI_INT_MAP_REG register
 *  NA
 */
#define CORE0_LPI_INT_MAP_REG (DR_REG_CORE0_BASE + 0x168)
/** CORE0_CORE0_LPI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_LPI_INT_MAP    0x0000003FU
#define CORE0_CORE0_LPI_INT_MAP_M  (CORE0_CORE0_LPI_INT_MAP_V << CORE0_CORE0_LPI_INT_MAP_S)
#define CORE0_CORE0_LPI_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_LPI_INT_MAP_S  0

/** CORE0_PMT_INT_MAP_REG register
 *  NA
 */
#define CORE0_PMT_INT_MAP_REG (DR_REG_CORE0_BASE + 0x16c)
/** CORE0_CORE0_PMT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_PMT_INT_MAP    0x0000003FU
#define CORE0_CORE0_PMT_INT_MAP_M  (CORE0_CORE0_PMT_INT_MAP_V << CORE0_CORE0_PMT_INT_MAP_S)
#define CORE0_CORE0_PMT_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_PMT_INT_MAP_S  0

/** CORE0_SBD_INT_MAP_REG register
 *  NA
 */
#define CORE0_SBD_INT_MAP_REG (DR_REG_CORE0_BASE + 0x170)
/** CORE0_CORE0_SBD_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_SBD_INT_MAP    0x0000003FU
#define CORE0_CORE0_SBD_INT_MAP_M  (CORE0_CORE0_SBD_INT_MAP_V << CORE0_CORE0_SBD_INT_MAP_S)
#define CORE0_CORE0_SBD_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_SBD_INT_MAP_S  0

/** CORE0_USB_OTG_INT_MAP_REG register
 *  NA
 */
#define CORE0_USB_OTG_INT_MAP_REG (DR_REG_CORE0_BASE + 0x174)
/** CORE0_CORE0_USB_OTG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_USB_OTG_INT_MAP    0x0000003FU
#define CORE0_CORE0_USB_OTG_INT_MAP_M  (CORE0_CORE0_USB_OTG_INT_MAP_V << CORE0_CORE0_USB_OTG_INT_MAP_S)
#define CORE0_CORE0_USB_OTG_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_USB_OTG_INT_MAP_S  0

/** CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_REG register
 *  NA
 */
#define CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_REG (DR_REG_CORE0_BASE + 0x178)
/** CORE0_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP    0x0000003FU
#define CORE0_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_M  (CORE0_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_V << CORE0_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_S)
#define CORE0_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_S  0

/** CORE0_JPEG_INT_MAP_REG register
 *  NA
 */
#define CORE0_JPEG_INT_MAP_REG (DR_REG_CORE0_BASE + 0x17c)
/** CORE0_CORE0_JPEG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_JPEG_INT_MAP    0x0000003FU
#define CORE0_CORE0_JPEG_INT_MAP_M  (CORE0_CORE0_JPEG_INT_MAP_V << CORE0_CORE0_JPEG_INT_MAP_S)
#define CORE0_CORE0_JPEG_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_JPEG_INT_MAP_S  0

/** CORE0_PPA_INT_MAP_REG register
 *  NA
 */
#define CORE0_PPA_INT_MAP_REG (DR_REG_CORE0_BASE + 0x180)
/** CORE0_CORE0_PPA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_PPA_INT_MAP    0x0000003FU
#define CORE0_CORE0_PPA_INT_MAP_M  (CORE0_CORE0_PPA_INT_MAP_V << CORE0_CORE0_PPA_INT_MAP_S)
#define CORE0_CORE0_PPA_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_PPA_INT_MAP_S  0

/** CORE0_CORE0_TRACE_INT_MAP_REG register
 *  NA
 */
#define CORE0_CORE0_TRACE_INT_MAP_REG (DR_REG_CORE0_BASE + 0x184)
/** CORE0_CORE0_CORE0_TRACE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_CORE0_TRACE_INT_MAP    0x0000003FU
#define CORE0_CORE0_CORE0_TRACE_INT_MAP_M  (CORE0_CORE0_CORE0_TRACE_INT_MAP_V << CORE0_CORE0_CORE0_TRACE_INT_MAP_S)
#define CORE0_CORE0_CORE0_TRACE_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_CORE0_TRACE_INT_MAP_S  0

/** CORE0_CORE1_TRACE_INT_MAP_REG register
 *  NA
 */
#define CORE0_CORE1_TRACE_INT_MAP_REG (DR_REG_CORE0_BASE + 0x188)
/** CORE0_CORE0_CORE1_TRACE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_CORE1_TRACE_INT_MAP    0x0000003FU
#define CORE0_CORE0_CORE1_TRACE_INT_MAP_M  (CORE0_CORE0_CORE1_TRACE_INT_MAP_V << CORE0_CORE0_CORE1_TRACE_INT_MAP_S)
#define CORE0_CORE0_CORE1_TRACE_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_CORE1_TRACE_INT_MAP_S  0

/** CORE0_HP_CORE_CTRL_INT_MAP_REG register
 *  NA
 */
#define CORE0_HP_CORE_CTRL_INT_MAP_REG (DR_REG_CORE0_BASE + 0x18c)
/** CORE0_CORE0_HP_CORE_CTRL_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_HP_CORE_CTRL_INT_MAP    0x0000003FU
#define CORE0_CORE0_HP_CORE_CTRL_INT_MAP_M  (CORE0_CORE0_HP_CORE_CTRL_INT_MAP_V << CORE0_CORE0_HP_CORE_CTRL_INT_MAP_S)
#define CORE0_CORE0_HP_CORE_CTRL_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_HP_CORE_CTRL_INT_MAP_S  0

