espressif/esp-idf/components/soc/esp32p4/include/soc/core0_interrupt_reg.h
/** CORE0_ISP_INT_MAP_REG register
 *  NA
 */
#define CORE0_ISP_INT_MAP_REG (DR_REG_CORE0_BASE + 0x190)
/** CORE0_CORE0_ISP_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_ISP_INT_MAP    0x0000003FU
#define CORE0_CORE0_ISP_INT_MAP_M  (CORE0_CORE0_ISP_INT_MAP_V << CORE0_CORE0_ISP_INT_MAP_S)
#define CORE0_CORE0_ISP_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_ISP_INT_MAP_S  0

/** CORE0_I3C_MST_INT_MAP_REG register
 *  NA
 */
#define CORE0_I3C_MST_INT_MAP_REG (DR_REG_CORE0_BASE + 0x194)
/** CORE0_CORE0_I3C_MST_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_I3C_MST_INT_MAP    0x0000003FU
#define CORE0_CORE0_I3C_MST_INT_MAP_M  (CORE0_CORE0_I3C_MST_INT_MAP_V << CORE0_CORE0_I3C_MST_INT_MAP_S)
#define CORE0_CORE0_I3C_MST_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_I3C_MST_INT_MAP_S  0

/** CORE0_I3C_SLV_INT_MAP_REG register
 *  NA
 */
#define CORE0_I3C_SLV_INT_MAP_REG (DR_REG_CORE0_BASE + 0x198)
/** CORE0_CORE0_I3C_SLV_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_I3C_SLV_INT_MAP    0x0000003FU
#define CORE0_CORE0_I3C_SLV_INT_MAP_M  (CORE0_CORE0_I3C_SLV_INT_MAP_V << CORE0_CORE0_I3C_SLV_INT_MAP_S)
#define CORE0_CORE0_I3C_SLV_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_I3C_SLV_INT_MAP_S  0

/** CORE0_USB_OTG11_INT_MAP_REG register
 *  NA
 */
#define CORE0_USB_OTG11_INT_MAP_REG (DR_REG_CORE0_BASE + 0x19c)
/** CORE0_CORE0_USB_OTG11_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_USB_OTG11_INT_MAP    0x0000003FU
#define CORE0_CORE0_USB_OTG11_INT_MAP_M  (CORE0_CORE0_USB_OTG11_INT_MAP_V << CORE0_CORE0_USB_OTG11_INT_MAP_S)
#define CORE0_CORE0_USB_OTG11_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_USB_OTG11_INT_MAP_S  0

/** CORE0_DMA2D_IN_CH0_INT_MAP_REG register
 *  NA
 */
#define CORE0_DMA2D_IN_CH0_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1a0)
/** CORE0_CORE0_DMA2D_IN_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_DMA2D_IN_CH0_INT_MAP    0x0000003FU
#define CORE0_CORE0_DMA2D_IN_CH0_INT_MAP_M  (CORE0_CORE0_DMA2D_IN_CH0_INT_MAP_V << CORE0_CORE0_DMA2D_IN_CH0_INT_MAP_S)
#define CORE0_CORE0_DMA2D_IN_CH0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_DMA2D_IN_CH0_INT_MAP_S  0

/** CORE0_DMA2D_IN_CH1_INT_MAP_REG register
 *  NA
 */
#define CORE0_DMA2D_IN_CH1_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1a4)
/** CORE0_CORE0_DMA2D_IN_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_DMA2D_IN_CH1_INT_MAP    0x0000003FU
#define CORE0_CORE0_DMA2D_IN_CH1_INT_MAP_M  (CORE0_CORE0_DMA2D_IN_CH1_INT_MAP_V << CORE0_CORE0_DMA2D_IN_CH1_INT_MAP_S)
#define CORE0_CORE0_DMA2D_IN_CH1_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_DMA2D_IN_CH1_INT_MAP_S  0

/** CORE0_DMA2D_OUT_CH0_INT_MAP_REG register
 *  NA
 */
#define CORE0_DMA2D_OUT_CH0_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1a8)
/** CORE0_CORE0_DMA2D_OUT_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_DMA2D_OUT_CH0_INT_MAP    0x0000003FU
#define CORE0_CORE0_DMA2D_OUT_CH0_INT_MAP_M  (CORE0_CORE0_DMA2D_OUT_CH0_INT_MAP_V << CORE0_CORE0_DMA2D_OUT_CH0_INT_MAP_S)
#define CORE0_CORE0_DMA2D_OUT_CH0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_DMA2D_OUT_CH0_INT_MAP_S  0

/** CORE0_DMA2D_OUT_CH1_INT_MAP_REG register
 *  NA
 */
#define CORE0_DMA2D_OUT_CH1_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1ac)
/** CORE0_CORE0_DMA2D_OUT_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_DMA2D_OUT_CH1_INT_MAP    0x0000003FU
#define CORE0_CORE0_DMA2D_OUT_CH1_INT_MAP_M  (CORE0_CORE0_DMA2D_OUT_CH1_INT_MAP_V << CORE0_CORE0_DMA2D_OUT_CH1_INT_MAP_S)
#define CORE0_CORE0_DMA2D_OUT_CH1_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_DMA2D_OUT_CH1_INT_MAP_S  0

/** CORE0_DMA2D_OUT_CH2_INT_MAP_REG register
 *  NA
 */
#define CORE0_DMA2D_OUT_CH2_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1b0)
/** CORE0_CORE0_DMA2D_OUT_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_DMA2D_OUT_CH2_INT_MAP    0x0000003FU
#define CORE0_CORE0_DMA2D_OUT_CH2_INT_MAP_M  (CORE0_CORE0_DMA2D_OUT_CH2_INT_MAP_V << CORE0_CORE0_DMA2D_OUT_CH2_INT_MAP_S)
#define CORE0_CORE0_DMA2D_OUT_CH2_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_DMA2D_OUT_CH2_INT_MAP_S  0

/** CORE0_PSRAM_MSPI_INT_MAP_REG register
 *  NA
 */
#define CORE0_PSRAM_MSPI_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1b4)
/** CORE0_CORE0_PSRAM_MSPI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_PSRAM_MSPI_INT_MAP    0x0000003FU
#define CORE0_CORE0_PSRAM_MSPI_INT_MAP_M  (CORE0_CORE0_PSRAM_MSPI_INT_MAP_V << CORE0_CORE0_PSRAM_MSPI_INT_MAP_S)
#define CORE0_CORE0_PSRAM_MSPI_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_PSRAM_MSPI_INT_MAP_S  0

/** CORE0_HP_SYSREG_INT_MAP_REG register
 *  NA
 */
#define CORE0_HP_SYSREG_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1b8)
/** CORE0_CORE0_HP_SYSREG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_HP_SYSREG_INT_MAP    0x0000003FU
#define CORE0_CORE0_HP_SYSREG_INT_MAP_M  (CORE0_CORE0_HP_SYSREG_INT_MAP_V << CORE0_CORE0_HP_SYSREG_INT_MAP_S)
#define CORE0_CORE0_HP_SYSREG_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_HP_SYSREG_INT_MAP_S  0

/** CORE0_PCNT_INT_MAP_REG register
 *  NA
 */
#define CORE0_PCNT_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1bc)
/** CORE0_CORE0_PCNT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_PCNT_INT_MAP    0x0000003FU
#define CORE0_CORE0_PCNT_INT_MAP_M  (CORE0_CORE0_PCNT_INT_MAP_V << CORE0_CORE0_PCNT_INT_MAP_S)
#define CORE0_CORE0_PCNT_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_PCNT_INT_MAP_S  0

/** CORE0_HP_PAU_INT_MAP_REG register
 *  NA
 */
#define CORE0_HP_PAU_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1c0)
/** CORE0_CORE0_HP_PAU_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_HP_PAU_INT_MAP    0x0000003FU
#define CORE0_CORE0_HP_PAU_INT_MAP_M  (CORE0_CORE0_HP_PAU_INT_MAP_V << CORE0_CORE0_HP_PAU_INT_MAP_S)
#define CORE0_CORE0_HP_PAU_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_HP_PAU_INT_MAP_S  0

/** CORE0_HP_PARLIO_RX_INT_MAP_REG register
 *  NA
 */
#define CORE0_HP_PARLIO_RX_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1c4)
/** CORE0_CORE0_HP_PARLIO_RX_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_HP_PARLIO_RX_INT_MAP    0x0000003FU
#define CORE0_CORE0_HP_PARLIO_RX_INT_MAP_M  (CORE0_CORE0_HP_PARLIO_RX_INT_MAP_V << CORE0_CORE0_HP_PARLIO_RX_INT_MAP_S)
#define CORE0_CORE0_HP_PARLIO_RX_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_HP_PARLIO_RX_INT_MAP_S  0

/** CORE0_HP_PARLIO_TX_INT_MAP_REG register
 *  NA
 */
#define CORE0_HP_PARLIO_TX_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1c8)
/** CORE0_CORE0_HP_PARLIO_TX_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_HP_PARLIO_TX_INT_MAP    0x0000003FU
#define CORE0_CORE0_HP_PARLIO_TX_INT_MAP_M  (CORE0_CORE0_HP_PARLIO_TX_INT_MAP_V << CORE0_CORE0_HP_PARLIO_TX_INT_MAP_S)
#define CORE0_CORE0_HP_PARLIO_TX_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_HP_PARLIO_TX_INT_MAP_S  0

/** CORE0_H264_DMA2D_OUT_CH0_INT_MAP_REG register
 *  NA
 */
#define CORE0_H264_DMA2D_OUT_CH0_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1cc)
/** CORE0_CORE0_H264_DMA2D_OUT_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_H264_DMA2D_OUT_CH0_INT_MAP    0x0000003FU
#define CORE0_CORE0_H264_DMA2D_OUT_CH0_INT_MAP_M  (CORE0_CORE0_H264_DMA2D_OUT_CH0_INT_MAP_V << CORE0_CORE0_H264_DMA2D_OUT_CH0_INT_MAP_S)
#define CORE0_CORE0_H264_DMA2D_OUT_CH0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_H264_DMA2D_OUT_CH0_INT_MAP_S  0

/** CORE0_H264_DMA2D_OUT_CH1_INT_MAP_REG register
 *  NA
 */
#define CORE0_H264_DMA2D_OUT_CH1_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1d0)
/** CORE0_CORE0_H264_DMA2D_OUT_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_H264_DMA2D_OUT_CH1_INT_MAP    0x0000003FU
#define CORE0_CORE0_H264_DMA2D_OUT_CH1_INT_MAP_M  (CORE0_CORE0_H264_DMA2D_OUT_CH1_INT_MAP_V << CORE0_CORE0_H264_DMA2D_OUT_CH1_INT_MAP_S)
#define CORE0_CORE0_H264_DMA2D_OUT_CH1_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_H264_DMA2D_OUT_CH1_INT_MAP_S  0

/** CORE0_H264_DMA2D_OUT_CH2_INT_MAP_REG register
 *  NA
 */
#define CORE0_H264_DMA2D_OUT_CH2_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1d4)
/** CORE0_CORE0_H264_DMA2D_OUT_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_H264_DMA2D_OUT_CH2_INT_MAP    0x0000003FU
#define CORE0_CORE0_H264_DMA2D_OUT_CH2_INT_MAP_M  (CORE0_CORE0_H264_DMA2D_OUT_CH2_INT_MAP_V << CORE0_CORE0_H264_DMA2D_OUT_CH2_INT_MAP_S)
#define CORE0_CORE0_H264_DMA2D_OUT_CH2_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_H264_DMA2D_OUT_CH2_INT_MAP_S  0

/** CORE0_H264_DMA2D_OUT_CH3_INT_MAP_REG register
 *  NA
 */
#define CORE0_H264_DMA2D_OUT_CH3_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1d8)
/** CORE0_CORE0_H264_DMA2D_OUT_CH3_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_H264_DMA2D_OUT_CH3_INT_MAP    0x0000003FU
#define CORE0_CORE0_H264_DMA2D_OUT_CH3_INT_MAP_M  (CORE0_CORE0_H264_DMA2D_OUT_CH3_INT_MAP_V << CORE0_CORE0_H264_DMA2D_OUT_CH3_INT_MAP_S)
#define CORE0_CORE0_H264_DMA2D_OUT_CH3_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_H264_DMA2D_OUT_CH3_INT_MAP_S  0

/** CORE0_H264_DMA2D_OUT_CH4_INT_MAP_REG register
 *  NA
 */
#define CORE0_H264_DMA2D_OUT_CH4_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1dc)
/** CORE0_CORE0_H264_DMA2D_OUT_CH4_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_H264_DMA2D_OUT_CH4_INT_MAP    0x0000003FU
#define CORE0_CORE0_H264_DMA2D_OUT_CH4_INT_MAP_M  (CORE0_CORE0_H264_DMA2D_OUT_CH4_INT_MAP_V << CORE0_CORE0_H264_DMA2D_OUT_CH4_INT_MAP_S)
#define CORE0_CORE0_H264_DMA2D_OUT_CH4_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_H264_DMA2D_OUT_CH4_INT_MAP_S  0

/** CORE0_H264_DMA2D_IN_CH0_INT_MAP_REG register
 *  NA
 */
#define CORE0_H264_DMA2D_IN_CH0_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1e0)
/** CORE0_CORE0_H264_DMA2D_IN_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_H264_DMA2D_IN_CH0_INT_MAP    0x0000003FU
#define CORE0_CORE0_H264_DMA2D_IN_CH0_INT_MAP_M  (CORE0_CORE0_H264_DMA2D_IN_CH0_INT_MAP_V << CORE0_CORE0_H264_DMA2D_IN_CH0_INT_MAP_S)
#define CORE0_CORE0_H264_DMA2D_IN_CH0_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_H264_DMA2D_IN_CH0_INT_MAP_S  0

/** CORE0_H264_DMA2D_IN_CH1_INT_MAP_REG register
 *  NA
 */
#define CORE0_H264_DMA2D_IN_CH1_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1e4)
/** CORE0_CORE0_H264_DMA2D_IN_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_H264_DMA2D_IN_CH1_INT_MAP    0x0000003FU
#define CORE0_CORE0_H264_DMA2D_IN_CH1_INT_MAP_M  (CORE0_CORE0_H264_DMA2D_IN_CH1_INT_MAP_V << CORE0_CORE0_H264_DMA2D_IN_CH1_INT_MAP_S)
#define CORE0_CORE0_H264_DMA2D_IN_CH1_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_H264_DMA2D_IN_CH1_INT_MAP_S  0

/** CORE0_H264_DMA2D_IN_CH2_INT_MAP_REG register
 *  NA
 */
#define CORE0_H264_DMA2D_IN_CH2_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1e8)
/** CORE0_CORE0_H264_DMA2D_IN_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_H264_DMA2D_IN_CH2_INT_MAP    0x0000003FU
#define CORE0_CORE0_H264_DMA2D_IN_CH2_INT_MAP_M  (CORE0_CORE0_H264_DMA2D_IN_CH2_INT_MAP_V << CORE0_CORE0_H264_DMA2D_IN_CH2_INT_MAP_S)
#define CORE0_CORE0_H264_DMA2D_IN_CH2_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_H264_DMA2D_IN_CH2_INT_MAP_S  0

/** CORE0_H264_DMA2D_IN_CH3_INT_MAP_REG register
 *  NA
 */
#define CORE0_H264_DMA2D_IN_CH3_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1ec)
/** CORE0_CORE0_H264_DMA2D_IN_CH3_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_H264_DMA2D_IN_CH3_INT_MAP    0x0000003FU
#define CORE0_CORE0_H264_DMA2D_IN_CH3_INT_MAP_M  (CORE0_CORE0_H264_DMA2D_IN_CH3_INT_MAP_V << CORE0_CORE0_H264_DMA2D_IN_CH3_INT_MAP_S)
#define CORE0_CORE0_H264_DMA2D_IN_CH3_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_H264_DMA2D_IN_CH3_INT_MAP_S  0

/** CORE0_H264_DMA2D_IN_CH4_INT_MAP_REG register
 *  NA
 */
#define CORE0_H264_DMA2D_IN_CH4_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1f0)
/** CORE0_CORE0_H264_DMA2D_IN_CH4_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_H264_DMA2D_IN_CH4_INT_MAP    0x0000003FU
#define CORE0_CORE0_H264_DMA2D_IN_CH4_INT_MAP_M  (CORE0_CORE0_H264_DMA2D_IN_CH4_INT_MAP_V << CORE0_CORE0_H264_DMA2D_IN_CH4_INT_MAP_S)
#define CORE0_CORE0_H264_DMA2D_IN_CH4_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_H264_DMA2D_IN_CH4_INT_MAP_S  0

/** CORE0_H264_DMA2D_IN_CH5_INT_MAP_REG register
 *  NA
 */
#define CORE0_H264_DMA2D_IN_CH5_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1f4)
/** CORE0_CORE0_H264_DMA2D_IN_CH5_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_H264_DMA2D_IN_CH5_INT_MAP    0x0000003FU
#define CORE0_CORE0_H264_DMA2D_IN_CH5_INT_MAP_M  (CORE0_CORE0_H264_DMA2D_IN_CH5_INT_MAP_V << CORE0_CORE0_H264_DMA2D_IN_CH5_INT_MAP_S)
#define CORE0_CORE0_H264_DMA2D_IN_CH5_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_H264_DMA2D_IN_CH5_INT_MAP_S  0

/** CORE0_H264_REG_INT_MAP_REG register
 *  NA
 */
#define CORE0_H264_REG_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1f8)
/** CORE0_CORE0_H264_REG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_H264_REG_INT_MAP    0x0000003FU
#define CORE0_CORE0_H264_REG_INT_MAP_M  (CORE0_CORE0_H264_REG_INT_MAP_V << CORE0_CORE0_H264_REG_INT_MAP_S)
#define CORE0_CORE0_H264_REG_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_H264_REG_INT_MAP_S  0

/** CORE0_ASSIST_DEBUG_INT_MAP_REG register
 *  NA
 */
#define CORE0_ASSIST_DEBUG_INT_MAP_REG (DR_REG_CORE0_BASE + 0x1fc)
/** CORE0_CORE0_ASSIST_DEBUG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_ASSIST_DEBUG_INT_MAP    0x0000003FU
#define CORE0_CORE0_ASSIST_DEBUG_INT_MAP_M  (CORE0_CORE0_ASSIST_DEBUG_INT_MAP_V << CORE0_CORE0_ASSIST_DEBUG_INT_MAP_S)
#define CORE0_CORE0_ASSIST_DEBUG_INT_MAP_V  0x0000003FU
#define CORE0_CORE0_ASSIST_DEBUG_INT_MAP_S  0

/** CORE0_INTR_STATUS_REG_0_REG register
 *  NA
 */
#define CORE0_INTR_STATUS_REG_0_REG (DR_REG_CORE0_BASE + 0x200)
/** CORE0_CORE0_INTR_STATUS_0 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_INTR_STATUS_0    0xFFFFFFFFU
#define CORE0_CORE0_INTR_STATUS_0_M  (CORE0_CORE0_INTR_STATUS_0_V << CORE0_CORE0_INTR_STATUS_0_S)
#define CORE0_CORE0_INTR_STATUS_0_V  0xFFFFFFFFU
#define CORE0_CORE0_INTR_STATUS_0_S  0

/** CORE0_INTR_STATUS_REG_1_REG register
 *  NA
 */
#define CORE0_INTR_STATUS_REG_1_REG (DR_REG_CORE0_BASE + 0x204)
/** CORE0_CORE0_INTR_STATUS_1 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_INTR_STATUS_1    0xFFFFFFFFU
#define CORE0_CORE0_INTR_STATUS_1_M  (CORE0_CORE0_INTR_STATUS_1_V << CORE0_CORE0_INTR_STATUS_1_S)
#define CORE0_CORE0_INTR_STATUS_1_V  0xFFFFFFFFU
#define CORE0_CORE0_INTR_STATUS_1_S  0

