espressif/esp-idf/components/soc/esp32p4/include/soc/core0_interrupt_reg.h
/** CORE0_INTR_STATUS_REG_2_REG register
 *  NA
 */
#define CORE0_INTR_STATUS_REG_2_REG (DR_REG_CORE0_BASE + 0x208)
/** CORE0_CORE0_INTR_STATUS_2 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_INTR_STATUS_2    0xFFFFFFFFU
#define CORE0_CORE0_INTR_STATUS_2_M  (CORE0_CORE0_INTR_STATUS_2_V << CORE0_CORE0_INTR_STATUS_2_S)
#define CORE0_CORE0_INTR_STATUS_2_V  0xFFFFFFFFU
#define CORE0_CORE0_INTR_STATUS_2_S  0

/** CORE0_INTR_STATUS_REG_3_REG register
 *  NA
 */
#define CORE0_INTR_STATUS_REG_3_REG (DR_REG_CORE0_BASE + 0x20c)
/** CORE0_CORE0_INTR_STATUS_3 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define CORE0_CORE0_INTR_STATUS_3    0xFFFFFFFFU
#define CORE0_CORE0_INTR_STATUS_3_M  (CORE0_CORE0_INTR_STATUS_3_V << CORE0_CORE0_INTR_STATUS_3_S)
#define CORE0_CORE0_INTR_STATUS_3_V  0xFFFFFFFFU
#define CORE0_CORE0_INTR_STATUS_3_S  0

/** CORE0_CLOCK_GATE_REG register
 *  NA
 */
#define CORE0_CLOCK_GATE_REG (DR_REG_CORE0_BASE + 0x210)
/** CORE0_CORE0_REG_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  NA
 */
#define CORE0_CORE0_REG_CLK_EN    (BIT(0))
#define CORE0_CORE0_REG_CLK_EN_M  (CORE0_CORE0_REG_CLK_EN_V << CORE0_CORE0_REG_CLK_EN_S)
#define CORE0_CORE0_REG_CLK_EN_V  0x00000001U
#define CORE0_CORE0_REG_CLK_EN_S  0

/** CORE0_INTERRUPT_REG_DATE_REG register
 *  NA
 */
#define CORE0_INTERRUPT_REG_DATE_REG (DR_REG_CORE0_BASE + 0x3fc)
/** CORE0_CORE0_INTERRUPT_REG_DATE : R/W; bitpos: [27:0]; default: 33566752;
 *  NA
 */
#define CORE0_CORE0_INTERRUPT_REG_DATE    0x0FFFFFFFU
#define CORE0_CORE0_INTERRUPT_REG_DATE_M  (CORE0_CORE0_INTERRUPT_REG_DATE_V << CORE0_CORE0_INTERRUPT_REG_DATE_S)
#define CORE0_CORE0_INTERRUPT_REG_DATE_V  0x0FFFFFFFU
#define CORE0_CORE0_INTERRUPT_REG_DATE_S  0

#ifdef __cplusplus
}
#endif
